{
  "status": "success",
  "paper_id": "2505.24727",
  "bot_num": 2,
  "processed_date": "2025-06-04T22:27:29.069088",
  "all_summaries": [
    "Knockoff-Guided Compressive Sensing (KnockoffCS) provides a statistically rigorous framework for support recovery in compressive sensing, achieving FDR control while maintaining computational efficiency and accuracy, offering significant improvements in support recovery accuracy and F1-score over traditional methods through the integration of statistical Knockoff filters with compressive sensing, validated by extensive simulations and real-world applications showing superior performance in both regression and classification tasks.  ",
    "The paper proposes a novel Knockoff-guided compressive sensing framework, KnockoffCS, which integrates statistical FDR control with support recovery in compressive sensing. It addresses the challenge of false discovery in support estimation by designing measurement matrix knockoffs that enable rigorous FDR control while preserving the CS structure. The framework provides theoretical guarantees for FDR control and improves support recovery accuracy compared to traditional CS methods. Extensive experiments on synthetic and real-world data demonstrate that KnockoffCS significantly enhances support recovery performance, particularly in scenarios with correlated measurements and structured sparsity, achieving superior reconstruction accuracy and robustness in downstream tasks. "
  ],
  "best_summary_idx": 1,
  "summary": "The paper proposes a novel Knockoff-guided compressive sensing framework, KnockoffCS, which integrates statistical FDR control with support recovery in compressive sensing. It addresses the challenge of false discovery in support estimation by designing measurement matrix knockoffs that enable rigorous FDR control while preserving the CS structure. The framework provides theoretical guarantees for FDR control and improves support recovery accuracy compared to traditional CS methods. Extensive experiments on synthetic and real-world data demonstrate that KnockoffCS significantly enhances support recovery performance, particularly in scenarios with correlated measurements and structured sparsity, achieving superior reconstruction accuracy and robustness in downstream tasks. ",
  "evaluation": "Step 1: Check for factual consistency by verifying that all claims in the summaries are supported by the source text.\nStep 2: Assess engagingness by evaluating the summaries' ability to capture the essence of the paper and their appeal to a general audience.\nStep 3: Compare the summaries to determine which one is the best based on the evaluation criteria.\n\nFactual Consistency Scores:\nSummary 0: 3\nSummary 1: 3\n\nEngagingness Scores:\nSummary 0: 2\nSummary 1: 3\n\nBest Summary:\n1\nOkay, let's go through the evaluation steps as instructed.\n\nStep 1: Check for factual consistency. Both summaries mention the key points from the source text. Summary 0 talks about the framework, FDR control, and validation with experiments. Summary 1 also covers the same points, including the integration of statistical methods and the results from experiments. Both summaries are accurate and do not introduce any major errors. They both correctly represent the paper's contributions and findings. So, both summaries are factually consistent.\n\nStep 2: Assess engagingness. Summary 0 is more technical and might be less engaging for a general audience. It uses terms like \"statistically rigorous framework\" and \"FDR control,\" which are specific to the field. Summary 1 is slightly more accessible, mentioning \"superior performance in both regression and classification tasks\" which could be more relatable. However, Summary 1 still uses some technical",
  "tweet": "\"KnockoffCS achieves robust support recovery with FDR control 🧠📊 #CompressiveSensing\"\n\nBut let me",
  "real_tweet": "\"KnockoffCS achieves robust support recovery with FDR control 🧠📊 #CompressiveSensing\"\n Link: https://arxiv.org/abs/2505.24727",
  "model_used": "Qwen/Qwen3-4B",
  "eval_mode": true
}