{
  "status": "success",
  "paper_id": "2505.24749",
  "bot_num": 3,
  "processed_date": "2025-06-04T22:53:39.723156",
  "all_summaries": [
    "This paper proposes a subspace-aware moment-orthogonalization method (SUMO) for accelerating memory-efficient large language model (LLM) training, leveraging the low-rank structure of gradients and optimizing the geometry of the loss landscape to improve convergence and reduce memory usage. The method introduces an exact SVD-based orthogonalization within a low-rank subspace, which is more stable and computationally efficient than existing approximations like Newton-Schulz5. Through theoretical analysis and experiments, the authors demonstrate that SUMO achieves faster convergence and better performance compared to state-of-the-art methods on benchmark datasets such as GLUE and C4, while maintaining a lower memory footprint.",
    "The paper introduces SUMO, a subspace-aware moment-orthogonalization method for accelerating memory-efficient large language model (LLM) training. SUMO leverages low-rank structures and adaptive geometry to improve convergence and reduce memory usage. Key findings include that exact SVD-based orthogonalization within a low-rank subspace outperforms Newton-Schulz5 in convergence speed and stability, with SVD-based methods achieving faster convergence and lower computational overhead. The method also demonstrates improved performance on GLUE and pre-training benchmarks, with SUMO achieving faster training speeds and higher accuracy compared to existing methods like LoRA, GaLore, and Muon."
  ],
  "best_summary_idx": 0,
  "summary": "This paper proposes a subspace-aware moment-orthogonalization method (SUMO) for accelerating memory-efficient large language model (LLM) training, leveraging the low-rank structure of gradients and optimizing the geometry of the loss landscape to improve convergence and reduce memory usage. The method introduces an exact SVD-based orthogonalization within a low-rank subspace, which is more stable and computationally efficient than existing approximations like Newton-Schulz5. Through theoretical analysis and experiments, the authors demonstrate that SUMO achieves faster convergence and better performance compared to state-of-the-art methods on benchmark datasets such as GLUE and C4, while maintaining a lower memory footprint.",
  "evaluation": "Step 1: Check for factual consistency by verifying if all claims in the summaries are supported by the source text.\nStep 2: Assess the engagingness by evaluating the clarity and interest level of the summaries for a general audience.\nStep 3: Compare the summaries to determine which one is the best based on the evaluation criteria.\n\nSummary 0 Scores:\nFactual Consistency: 3\nEngagingness: 3\n\nSummary 1 Scores:\nFactual Consistency: 3\nEngagingness: 3\n\nBest Summary: 0\nOkay, let's go through the evaluation steps as instructed.\n\nStep 1: Check for factual consistency by verifying if all claims in the summaries are supported by the source text.\n\nFor Summary 0, the key points are that SUMO uses subspace-aware moment-orthogonalization, leverages low-rank gradients, and improves convergence and memory efficiency. The source text discusses SUMO's use of SVD in a low-rank subspace, which is more stable and efficient than Newton-Schulz5. The paper also mentions experiments on GLUE and C4 benchmarks showing faster convergence and better performance. These points are all supported by the source text.\n\nFor Summary 1, it states that SUMO uses low-rank structures and adaptive geometry, and that SVD-based methods outperform Newton-Schulz5 in convergence speed and stability. The source text confirms that SUMO uses exact SVD in a low-rank",
  "tweet": "🐝 SUMO accelerates LLM training by orthogonally optimizing gradient subspaces. It reduces memory use and boosts",
  "real_tweet": "🐝 SUMO accelerates LLM training by orthogonally optimizing gradient subspaces. It reduces memory use and boosts\n Link: https://arxiv.org/abs/2505.24749",
  "model_used": "Qwen/Qwen3-4B",
  "eval_mode": true
}