{
  "status": "success",
  "paper_id": "2505.24843",
  "bot_num": 3,
  "processed_date": "2025-06-04T22:58:18.210396",
  "all_summaries": [
    "The paper introduces Noisy Counterfactual Matching (NCM), a method that uses invariant data pairs to improve robustness to spurious correlations by adding a constraint to empirical risk minimization (ERM). NCM is theoretically proven to be robust to spurious correlations, and empirically validated on synthetic and real-world datasets, showing improved performance compared to ERM and other baselines. The method leverages counterfactual pairs from training data, which are invariant under the optimally robust classifier, to enforce orthogonality with spurious features, enhancing generalization across domains.",
    "This paper presents a novel method called Noisy Counterfactual Matching (NCM) that enhances model robustness to spurious correlations by leveraging invariant data pairs derived from training domains. The method introduces a constraint to empirical risk minimization (ERM) ensuring predictions on invariant pairs match, thereby forcing the model to be orthogonal to spurious features. Theoretical analysis shows that NCM can provably robust to spurious correlations even with noisy counterfactuals, requiring only a small number of invariant pairs for robustness. Empirical evaluations on synthetic and real-world datasets demonstrate NCM's effectiveness in improving robustness compared to existing methods."
  ],
  "best_summary_idx": 1,
  "summary": "This paper presents a novel method called Noisy Counterfactual Matching (NCM) that enhances model robustness to spurious correlations by leveraging invariant data pairs derived from training domains. The method introduces a constraint to empirical risk minimization (ERM) ensuring predictions on invariant pairs match, thereby forcing the model to be orthogonal to spurious features. Theoretical analysis shows that NCM can provably robust to spurious correlations even with noisy counterfactuals, requiring only a small number of invariant pairs for robustness. Empirical evaluations on synthetic and real-world datasets demonstrate NCM's effectiveness in improving robustness compared to existing methods.",
  "evaluation": "Step 1: Check for factual consistency. Ensure that all claims in the summaries are supported by the source text.\nStep 2: Assess engagingness. Determine if the summaries are engaging to a general audience.\nStep 3: Compare the summaries to select the best one based on the criteria.\n\nSummary 0 Score:\nFactual Consistency: 3\nEngagingness: 3\n\nSummary 1 Score:\nFactual Consistency: 3\nEngagingness: 3\n\nBest Summary: 1\nOkay, let's go through the evaluation steps for the two summaries.\n\n**Step 1: Factual Consistency**  \nBoth summaries accurately reflect the content of the source text. They mention the introduction of Noisy Counterfactual Matching (NCM), its use of invariant data pairs, the constraint added to ERM, and the theoretical and empirical validations. The summaries correctly state that NCM is proven to be robust to spurious correlations and that it requires only a small number of invariant pairs. There are no major errors or unsupported claims in either summary. Both summaries are consistent with the source text.\n\n**Step 2: Engagingness**  \nBoth summaries are written in a clear and concise manner, making them accessible to a general audience. They explain the problem (spurious correlations), the proposed method (NCM), and its benefits (improved robustness and generalization). The summaries avoid overly technical jargon and focus on the key contributions and results. They",
  "tweet": "🐝 Invariant pairs force models to reject spurious cues, making them robust. #AI #Robustness\nOkay",
  "real_tweet": "🐝 Invariant pairs force models to reject spurious cues, making them robust. #AI #Robustness\n Link: https://arxiv.org/abs/2505.24843",
  "model_used": "Qwen/Qwen3-4B",
  "eval_mode": true
}