{
  "status": "success",
  "paper_id": "2501.06590",
  "bot_num": 0,
  "processed_date": "2025-06-05T21:54:28.212669",
  "all_summaries": [
    "This paper proposes a self-updating library system called ChemAgent to enhance chemical reasoning in large language models (LLMs). ChemAgent addresses the limitations of traditional LLMs in handling complex chemical problems by decomposing tasks into atomic sub-tasks, utilizing a structured memory system with planning, execution, and knowledge components, and dynamically updating its library based on prior problem-solving experiences. The library stores decomposed sub-tasks and their solutions, enabling LLMs to recall and refine solutions from previous tasks, leading to improved accuracy and performance. Experimental results show that ChemAgent outperforms existing methods, achieving significant accuracy improvements across various datasets, especially for stronger base models like GPT-4, with an average improvement of 37% and a maximum of 46% over direct reasoning. The system's self-learning and memory-enhanced reasoning processes contribute to its effectiveness in solving complex chemical problems.",
    "**Summary**: The paper proposes a novel approach called ChemAgent to enhance chemical reasoning in large language models (LLMs) by introducing a self-updating library system that stores and retrieves sub-tasks and solutions. This library enables iterative problem-solving through dynamic memory components such as Planning Memory, Execution Memory, and Knowledge Memory, which facilitate task decomposition, reasoning, and solution refinement. The system improves accuracy by leveraging past experiences and continuously updating its knowledge base, outperforming existing methods like StructChem by up to 46% in some datasets. Experiments on four chemical reasoning datasets from SciBench demonstrate that ChemAgent significantly enhances performance, with an average accuracy increase of 37% over base models and 10% over the state-of-the-art StructChem. The self-evolution of the library during runtime further boosts performance, showcasing the effectiveness of the self-updating memory system in improving chemical reasoning capabilities."
  ],
  "best_summary_idx": 1,
  "summary": "**Summary**: The paper proposes a novel approach called ChemAgent to enhance chemical reasoning in large language models (LLMs) by introducing a self-updating library system that stores and retrieves sub-tasks and solutions. This library enables iterative problem-solving through dynamic memory components such as Planning Memory, Execution Memory, and Knowledge Memory, which facilitate task decomposition, reasoning, and solution refinement. The system improves accuracy by leveraging past experiences and continuously updating its knowledge base, outperforming existing methods like StructChem by up to 46% in some datasets. Experiments on four chemical reasoning datasets from SciBench demonstrate that ChemAgent significantly enhances performance, with an average accuracy increase of 37% over base models and 10% over the state-of-the-art StructChem. The self-evolution of the library during runtime further boosts performance, showcasing the effectiveness of the self-updating memory system in improving chemical reasoning capabilities.",
  "evaluation": "Step 1: Check for factual consistency. Ensure that all claims in the summary are supported by the source text.\nStep 2: Assess the engagingness. Determine if the summary is engaging to a general audience.\nStep 3: Compare the summaries to identify the best one based on the criteria.\n\nSummary 0 Scores:\nFactual Consistency: 3\nEngagingness: 3\n\nSummary 1 Scores:\nFactual Consistency: 3\nEngagingness: 3\n\nBest Summary: 1\nOkay, let's start by evaluating the two summaries based on the given criteria.\n\n**Factual Consistency Check:**\n- **Summary 0** mentions that ChemAgent uses a self-updating library system to enhance chemical reasoning. The source text describes this as the core idea, so that's accurate. It also states that the library stores decomposed sub-tasks and solutions, which aligns with the source. The experimental results are correctly summarized, including the 37% and 46% improvements. All claims are supported by the text.\n- **Summary 1** accurately describes ChemAgent as a novel approach with a self-updating library. It correctly identifies the three memory components (Planning, Execution, Knowledge) and the improvements over StructChem. The experimental results are also accurately reflected, including the 10% and 15% improvements. All facts are supported by the source.\n\n**Engagingness Assessment:**\n- **Summary 0",
  "tweet": "**Drum roll 🥁** @stanfordhais’s new #AIIndex2025 report reveals a",
  "real_tweet": "**Drum roll 🥁** @stanfordhais’s new #AIIndex2025 report reveals a\n Link: https://arxiv.org/abs/2501.06590",
  "model_used": "Qwen/Qwen3-4B",
  "eval_mode": true
}