{
  "status": "success",
  "paper_id": "2502.11357",
  "bot_num": 0,
  "processed_date": "2025-06-05T22:10:23.762951",
  "all_summaries": [
    "The paper introduces Explorer, a scalable framework for generating diverse web trajectories by leveraging exploration-driven synthesis. The framework uses a multi-agent pipeline to systematically explore websites, producing 94K trajectories across 49K unique URLs, enriched with multimedia data. Explorer outperforms existing web agent baselines in tasks like Mind2Web-Live and MiniWob++, demonstrating superior performance and generalization. The dataset is extensive, with 720K screenshots and 33M web elements, and is used to train models like Phi-3.5V and Qwen2-VL-7B, achieving strong results on both online and offline benchmarks.",
    "This paper introduces Explorer, a scalable framework for synthesizing diverse web trajectory data to train GUI agents. It leverages exploration-driven methods to generate a large dataset of 94K trajectories across 49K unique URLs, richly annotated with screenshots, HTML, and accessibility trees. The framework involves a multi-agent pipeline that iteratively refines tasks through exploration, resulting in high-quality, real-world applicable trajectories. Explorer outperforms existing baselines in multiple benchmarks, demonstrating the effectiveness of its data in enhancing web agent performance. The dataset includes 720K screenshots and 33M web elements, making it the largest of its kind, and the framework improves task relevance and generalization"
  ],
  "best_summary_idx": 0,
  "summary": "The paper introduces Explorer, a scalable framework for generating diverse web trajectories by leveraging exploration-driven synthesis. The framework uses a multi-agent pipeline to systematically explore websites, producing 94K trajectories across 49K unique URLs, enriched with multimedia data. Explorer outperforms existing web agent baselines in tasks like Mind2Web-Live and MiniWob++, demonstrating superior performance and generalization. The dataset is extensive, with 720K screenshots and 33M web elements, and is used to train models like Phi-3.5V and Qwen2-VL-7B, achieving strong results on both online and offline benchmarks.",
  "evaluation": "Step 1: Check for factual consistency. Ensure that all claims in the summary are supported by the source text.\nStep 2: Assess engagingness. Determine if the summary is engaging to a general audience.\nStep 3: Compare summaries to identify the best one based on the criteria.\n\nSummary 0 Factual Consistency: 3 (Consistent). The summary accurately reflects the key points of the paper, including the introduction of Explorer, the multi-agent pipeline, the dataset size and content, and the performance on benchmarks. All claims are supported by the source text.\n\nSummary 1 Factual Consistency: 3 (Consistent). The summary also accurately reflects the key points, including the framework, dataset details, and performance. All claims are supported by the source text.\n\nSummary 0 Engagingness: 3 (Interesting). The summary is clear and concise, highlighting the significance of the work, the scale of the dataset, and its performance on benchmarks, which are appealing to both specialists and general audiences.\n\nSummary 1 Engagingness: 3 (Interesting). The summary is similarly engaging, emphasizing the framework, dataset size, and performance, which are relevant to a broad audience.\n\nBest Summary: 0:\n0:\n1:\n0:\n0:\n0:\n1:\n0:\n1:\n0:\n1:\n0:\n1:\n0",
  "tweet": "\"🚀 Explorer, a scalable framework for generating diverse web trajectories, leverages exploration-driven synthesis to produce 94K trajectories across",
  "real_tweet": "\"🚀 Explorer, a scalable framework for generating diverse web trajectories, leverages exploration-driven synthesis to produce 94K trajectories across\n Link: https://arxiv.org/abs/2502.11357",
  "model_used": "Qwen/Qwen3-4B",
  "eval_mode": true
}