{
  "status": "success",
  "paper_id": "2502.00212",
  "bot_num": 0,
  "processed_date": "2025-06-05T21:29:39.335191",
  "all_summaries": [
    "Self-play LLM Theorem Provers with Iterative Conjecturing and Proving (STP) addresses the challenges of improving reasoning capabilities in large language models (LLMs) by combining conjecture generation and proof validation in a self-reinforcing loop. Unlike traditional expert iteration, STP introduces a conjecturer that generates novel conjectures based on seed theorems, which are then validated by a prover. This dual-role framework enables the model to iteratively refine its conjectures and proofs, leveraging dense training signals from both components. Through extensive experiments on datasets like LeanWorkbook and Isabelle, STP achieves significantly higher proof success rates and outperforms prior methods, especially under varying sample budgets, demonstrating superior scalability and adaptability in formal reasoning tasks.",
    "The paper introduces Self-play Theorem Prover (STP), a system that combines conjecturer and prover roles to iteratively generate and verify conjectures, improving reasoning capabilities of large language models. STP addresses the limitations of traditional methods like expert iteration by generating diverse, approachable conjectures and utilizing self-play training to create a curriculum that scales with increasing difficulty. The model outperforms existing approaches on benchmark datasets such as LeanWorkbook, miniF2F-test, and PutnamBench, achieving higher pass rates and demonstrating superior performance in both training and inference phases. Key innovations include the use of self-play training with conjectures, automated curriculum learning, and the ability to self-improve without external data, making STP a significant advancement in automated theorem proving and large language model reasoning."
  ],
  "best_summary_idx": 1,
  "summary": "The paper introduces Self-play Theorem Prover (STP), a system that combines conjecturer and prover roles to iteratively generate and verify conjectures, improving reasoning capabilities of large language models. STP addresses the limitations of traditional methods like expert iteration by generating diverse, approachable conjectures and utilizing self-play training to create a curriculum that scales with increasing difficulty. The model outperforms existing approaches on benchmark datasets such as LeanWorkbook, miniF2F-test, and PutnamBench, achieving higher pass rates and demonstrating superior performance in both training and inference phases. Key innovations include the use of self-play training with conjectures, automated curriculum learning, and the ability to self-improve without external data, making STP a significant advancement in automated theorem proving and large language model reasoning.",
  "evaluation": "Step 1: Check for factual consistency by verifying if all claims in the summaries are supported by the source text.\nStep 2: Assess the engagingness by evaluating how well the summaries capture the novelty and significance of the research.\nStep 3: Compare the summaries to determine which one is the most accurate and compelling representation of the paper's contributions.\n\nFactual Consistency Scores:\nSummary 0: 3\nSummary 1: 3\n\nEngagingness Scores:\nSummary 0: 3\nSummary 1: 3\n\nBest Summary:\n1\nOkay, let's go through the evaluation steps as instructed.\n\nStep 1: Check for factual consistency by verifying if all claims in the summaries are supported by the source text.\n\nSummary 0 mentions that STP addresses challenges in improving LLM reasoning by combining conjecture generation and proof validation in a self-reinforcing loop. The source text discusses STP's dual roles of conjecturer and prover, which aligns with this. It also states that STP outperforms prior methods on datasets like LeanWorkbook and miniF2F-test, which is supported by the experiments section. The claim about self-improvement without external data is also in line with the paper's description of STP's self-play training.\n\nSummary 1 states that STP introduces a system combining conjecturer and prover roles, addresses limitations of expert iteration, and outperforms existing approaches on benchmarks. The source text confirms these points, including",
  "tweet": "\"🚀 New AI breakthrough: Self-Play Theorem Prover boosts reasoning power! 💡\" \n\nBut make it more concise",
  "real_tweet": "\"🚀 New AI breakthrough: Self-Play Theorem Prover boosts reasoning power! 💡\" \n Link: https://arxiv.org/abs/2502.00212",
  "model_used": "Qwen/Qwen3-4B",
  "eval_mode": true
}