{
  "status": "success",
  "paper_id": "2504.11900",
  "bot_num": 0,
  "processed_date": "2025-06-05T21:44:00.803585",
  "all_summaries": [
    "This paper introduces FLAWEDFICTIONSMAKER, an algorithm for automatically generating continuity errors in stories, which is used to create a benchmark called FLAWEDFICTIONS for evaluating LLMs' capabilities to reason about plot holes in stories. The authors analyze the performance of frontier LLMs on this benchmark and find that they struggle with accurately detecting plot holes, especially as story length increases. They also examine LLM-generated stories and find that they contain significantly higher continuity error rates compared to human-authored stories. The study highlights the limitations of current LLMs in deeper narrative understanding and suggests that further research is needed to improve their reasoning abilities in this domain.",
    "The paper introduces FLAWEDFICTIONSMAKER, an algorithm to generate continuity errors in stories, and presents FLAWEDFICTIONS, a benchmark dataset for evaluating LLMs' ability to detect plot holes. The study shows that frontier LLMs struggle with this task, with performance dropping as story length increases. Models often fail to track character motivations or states, misinterpret genre conventions, or overlook implicit world knowledge. The research highlights significant gaps in LLMs' narrative understanding, demonstrating that even the best models have difficulty identifying inconsistencies in stories, and that LLM-generated narratives contain higher continuity error rates compared to human-written ones. The work provides a novel evaluation framework for assessing deeper language understanding and reasoning in LLMs, with potential applications in improving the consistency of AI-generated content. "
  ],
  "best_summary_idx": 0,
  "summary": "This paper introduces FLAWEDFICTIONSMAKER, an algorithm for automatically generating continuity errors in stories, which is used to create a benchmark called FLAWEDFICTIONS for evaluating LLMs' capabilities to reason about plot holes in stories. The authors analyze the performance of frontier LLMs on this benchmark and find that they struggle with accurately detecting plot holes, especially as story length increases. They also examine LLM-generated stories and find that they contain significantly higher continuity error rates compared to human-authored stories. The study highlights the limitations of current LLMs in deeper narrative understanding and suggests that further research is needed to improve their reasoning abilities in this domain.",
  "evaluation": "- Check for factual consistency by comparing the summaries to the source text.\n- Assess the engagingness by evaluating the summaries for general interest and clarity.\n- Determine which summary best meets the criteria for both factual consistency and engagingness.\n\nSummary 0 Factual Consistency: 3 (Consistent): All facts supported\nSummary 0 Engagingness: 3 (Interesting): Engages general audiences regardless of expertise\nSummary 1 Factual Consistency: 3 (Consistent): All facts supported\nSummary 1 Engagingness: 2 (Somewhat interesting): Engages those familiar with the field\n\nBest Summary: 0\nNow, I need to rate the summaries based on the two metrics: factual consistency and engagingness. I will follow the evaluation steps outlined above.\n\nFirst, I will check for factual consistency by comparing the summaries to the source text. Summary 0 accurately reflects the main points of the paper, including the introduction of FLAWEDFICTIONSMAKER, the creation of the FLAWEDFICTIONS benchmark, and the findings regarding LLM performance. Summary 1 also captures the key elements of the study, such as the algorithm for generating continuity errors, the benchmark dataset, and the results showing LLM struggles with detecting plot holes. Both summaries are consistent with the source text.\n\nNext, I will assess the engagingness of each summary. Summary 0 is written in a clear and concise manner, making it accessible to a general audience. It explains the study",
  "tweet": "\"FLAWEDFICTIONSMAKER 🧠 #AIIndex2025 reveals LLMs struggle with plot hole",
  "real_tweet": "\"FLAWEDFICTIONSMAKER 🧠 #AIIndex2025 reveals LLMs struggle with plot hole\n Link: https://arxiv.org/abs/2504.11900",
  "model_used": "Qwen/Qwen3-4B",
  "eval_mode": true
}