{
  "status": "success",
  "paper_id": "2504.13203",
  "bot_num": 0,
  "processed_date": "2025-06-05T21:08:00.424727",
  "all_summaries": [
    "X-Teaming is a multi-agent framework that systematically identifies and exploits multi-turn jailbreaks in large language models, achieving up to 98.1% attack success rates on leading models like GPT-4o and DeepSeek V3, significantly outperforming prior methods. It combines strategic planning, adaptive execution, and prompt optimization to generate diverse attack plans and improve effectiveness, and introduces XGuard-Train, a large-scale dataset for multi-turn safety training, enhancing model robustness against harmful content generation.",
    "X-Teaming is a multi-agent framework that systematically explores diverse multi-turn jailbreaks through collaborative agents emulating human attack strategies, achieving state-of-the-art attack success rates of up to 98.1% on leading language models, significantly outperforming previous methods in both efficacy and attack diversity. It introduces XGuard-Train, a large-scale safety dataset for multi-turn LM safety, enhancing conversational AI safety through data-driven alignment. The framework's adaptive components, including a planner, attacker, verifier, and prompt optimizer, enable efficient and scalable identification of vulnerabilities, while its application in training robust safety models demonstrates improved resistance to multi-turn attacks."
  ],
  "best_summary_idx": 1,
  "summary": "X-Teaming is a multi-agent framework that systematically explores diverse multi-turn jailbreaks through collaborative agents emulating human attack strategies, achieving state-of-the-art attack success rates of up to 98.1% on leading language models, significantly outperforming previous methods in both efficacy and attack diversity. It introduces XGuard-Train, a large-scale safety dataset for multi-turn LM safety, enhancing conversational AI safety through data-driven alignment. The framework's adaptive components, including a planner, attacker, verifier, and prompt optimizer, enable efficient and scalable identification of vulnerabilities, while its application in training robust safety models demonstrates improved resistance to multi-turn attacks.",
  "evaluation": "Step 1: Check for factual consistency by verifying that all claims in the summaries are supported by the source text.\nStep 2: Assess engagingness by evaluating how well the summaries capture the significance and impact of X-Teaming and XGuard-Train.\nStep 3: Compare the summaries to determine which one best summarizes the key contributions and achievements of the research.\n\nFactual Consistency Scores:\nSummary 0: 3\nSummary 1: 3\n\nEngagingness Scores:\nSummary 0: 2\nSummary 1: 3\n\nBest Summary: 1\nOkay, let's start by evaluating the factual consistency of each summary. \n\nFor Summary 0, it mentions that X-Teaming achieves up to 98.1% attack success rates on models like GPT-4o and DeepSeek V3. The source text does state that X-Teaming achieves 98.1% ASR on DeepSeek V3 and 96.2% on Claude 3.7 Sonnet. It also mentions the introduction of XGuard-Train as a large-scale dataset for multi-turn safety training. These points are all supported by the source text, so Summary 0 is factually consistent.\n\nSummary 1 also states that X-Teaming achieves up to 98.1% attack success rates and introduces XGuard-Train. The source text confirms these points, including the framework's components like the planner, attacker, verifier",
  "tweet": "X-Teaming 🤖 excels at multi-turn jailbreaks, achieving 98.1% success rates.",
  "real_tweet": "X-Teaming 🤖 excels at multi-turn jailbreaks, achieving 98.1% success rates.\n Link: https://arxiv.org/abs/2504.13203",
  "model_used": "Qwen/Qwen3-4B",
  "eval_mode": true
}