{
  "status": "success",
  "paper_id": "2505.24498",
  "bot_num": 0,
  "processed_date": "2025-06-04T22:08:32.269247",
  "all_summaries": [
    "This paper presents an efficient neural and numerical method for real-time spectrogram inversion, combining a lightweight CNN with complex least squares to achieve high-quality waveform reconstruction. Key innovations include a significantly smaller CNN (∼8k parameters) with reduced computation, a latency-increase strategy to halve CNN computation without sacrificing quality, and a fast numerical solver leveraging tridiagonal matrices for the second stage, enabling orders-of-magnitude faster processing compared to existing methods. The approach maintains high quality and low latency, outperforming alternatives in both efficiency and performance. ",
    "This paper proposes an efficient neural and numerical method for real-time speech spectrogram inversion, leveraging the Gradient Theorem to jointly estimate phases from STFT magnitudes. Key innovations include a significantly smaller and faster CNN (8.46k parameters, 0.27 GMAC/s) for the first stage, reduced computation by increasing latency with a look-ahead frame (halving computation without sacrificing quality), and a tridiagonal, positive-semidefinite linear system for the second stage, enabling orders-of-magnitude faster phase estimation. The method achieves high-quality results comparable to existing approaches, with reduced computational costs and latency, making it suitable for real-time applications."
  ],
  "best_summary_idx": 1,
  "summary": "This paper proposes an efficient neural and numerical method for real-time speech spectrogram inversion, leveraging the Gradient Theorem to jointly estimate phases from STFT magnitudes. Key innovations include a significantly smaller and faster CNN (8.46k parameters, 0.27 GMAC/s) for the first stage, reduced computation by increasing latency with a look-ahead frame (halving computation without sacrificing quality), and a tridiagonal, positive-semidefinite linear system for the second stage, enabling orders-of-magnitude faster phase estimation. The method achieves high-quality results comparable to existing approaches, with reduced computational costs and latency, making it suitable for real-time applications.",
  "evaluation": "Step 1: Check for factual consistency by verifying that all claims in the summary are supported by the source text.\nStep 2: Assess engagingness by determining if the summary is accessible and interesting to a general audience.\nStep 3: Compare the summaries to determine which one is the best based on the criteria.\n\nFactual Consistency Scores:\nSummary 0: 2\nSummary 1: 3\n\nEngagingness Scores:\nSummary 0: 2\nSummary 1: 3\n\nBest Summary:\n1\nOkay, let's go through the evaluation steps for the two summaries based on the given criteria.\n\n**Step 1: Factual Consistency Check**\n- **Summary 0** mentions a CNN with ∼8k parameters and 0.27 GMAC/s, which matches the source text. It also states that the second stage uses a tridiagonal matrix for faster processing, which is accurate. However, it says the CNN is \"significantly smaller\" and \"reduced computation\" without specifying the exact reduction, which is mentioned in the source as 30 times smaller. This is a minor error, so it gets a 2.\n- **Summary 1** accurately describes the CNN with 8.46k parameters and 0.27 GMAC/s, the latency-increase strategy, and the tridiagonal matrix for the second stage. It correctly states the method's efficiency and performance, with no major errors. This",
  "tweet": "\"🚀 New method for real-time speech inversion using Gradient Theorem! Efficient CNN & fast phase estimation. Low cost, high quality",
  "real_tweet": "\"🚀 New method for real-time speech inversion using Gradient Theorem! Efficient CNN & fast phase estimation. Low cost, high quality\n Link: https://arxiv.org/abs/2505.24498",
  "model_used": "Qwen/Qwen3-4B",
  "eval_mode": true
}