{
  "status": "success",
  "paper_id": "2504.12626",
  "bot_num": 5,
  "processed_date": "2025-06-04T23:22:23.349810",
  "all_summaries": [
    "This paper introduces FramePack, a novel memory structure and anti-drifting sampling methods for next-frame prediction models in video generation, addressing the forgetting-drifting dilemma by compressing input frames based on their importance to limit context length and using bi-directional context through early-established endpoints or inverted temporal sampling to reduce error propagation. Key findings include that inverted anti-drifting sampling achieves superior performance across multiple metrics, including all drifting metrics, and that generating more frames per section improves perceptual quality. Additionally, FramePack enables efficient video generation with fixed computational bottlenecks and is compatible with existing video diffusion models.",
    "This paper introduces FramePack, an anti-forgetting memory structure and anti-drifting sampling methods for next-frame prediction in video generation, which addresses the forgetting-drifting dilemma by compressing input frames based on their importance, ensuring a fixed upper bound on total context length, and incorporating bi-directional context through endpoint frames or inverted temporal order. Key findings include that inverted anti-drifting sampling achieves top performance in multiple metrics and human evaluations, while FramePack improves model efficiency and visual quality, enabling longer video generation without increasing computational bottlenecks. "
  ],
  "best_summary_idx": 1,
  "summary": "This paper introduces FramePack, an anti-forgetting memory structure and anti-drifting sampling methods for next-frame prediction in video generation, which addresses the forgetting-drifting dilemma by compressing input frames based on their importance, ensuring a fixed upper bound on total context length, and incorporating bi-directional context through endpoint frames or inverted temporal order. Key findings include that inverted anti-drifting sampling achieves top performance in multiple metrics and human evaluations, while FramePack improves model efficiency and visual quality, enabling longer video generation without increasing computational bottlenecks. ",
  "evaluation": "Step 1: Check for factual consistency by verifying if all claims in the summaries are supported by the source text.\nStep 2: Assess engagingness by evaluating the clarity and interest level of the summaries for a general audience.\nStep 3: Compare the summaries to determine which one is the best based on the criteria.\n\nFactual Consistency Scores:\nSummary 0: 3\nSummary 1: 3\n\nEngagingness Scores:\nSummary 0: 3\nSummary 1: 3\n\nBest Summary:\n1\nOkay, let's go through this step by step. \n\nFirst, I need to check the factual consistency of both summaries against the source text. \n\nFor Summary 0: It mentions FramePack as a novel memory structure and anti-drifting sampling methods. The source text does talk about FramePack as an anti-forgetting memory structure and anti-drifting sampling methods. It also states that FramePack compresses input frames based on importance to limit context length and uses bi-directional context through endpoints or inverted temporal sampling. The key findings include inverted anti-drifting sampling achieving top performance and generating more frames per section improving quality. The source text supports all these points, so Summary 0 is factually consistent.\n\nFor Summary 1: It also refers to FramePack as an anti-forgetting memory structure and anti-drifting sampling methods. The source text confirms this. It mentions compressing input frames based on importance, fixed context length, and bi-directional context via",
  "tweet": "🧠 The key innovation in this work is FramePack—a memory structure & anti-drifting sampling method for video gen that solves",
  "real_tweet": "🧠 The key innovation in this work is FramePack—a memory structure & anti-drifting sampling method for video gen that solves\n Link: https://arxiv.org/abs/2504.12626",
  "model_used": "Qwen/Qwen3-4B",
  "eval_mode": true
}