{
  "status": "success",
  "paper_id": "2505.24728",
  "bot_num": 1,
  "processed_date": "2025-06-04T22:25:47.786967",
  "all_summaries": [
    "This paper proposes a robust federated learning method, SMRFL, which addresses the issue of non-malicious perturbations in edge networks by leveraging sharpness-aware minimization to encourage convergence to flat minima, improving model robustness and achieving comparable convergence rates to standard FL methods despite model degradation from perturbations. Experiments on real-world datasets demonstrate that SMRFL outperforms baselines like FedAvg in handling both uplink and downlink perturbations, maintaining higher test accuracy and faster convergence, especially under non-IID data conditions. ",
    "A new robust federated learning method called SMRFL is introduced, which uses sharpness-aware minimization to enhance model robustness against non-malicious perturbations in edge networks. The method converges to flat minima by incorporating SAM, improving resistance to model degradation from both uplink and downlink perturbations. Experiments on real-world datasets show that SMRFL outperforms baselines like FedAvg in test accuracy under various perturbation scenarios, demonstrating its effectiveness in handling non-malicious perturbations. Theoretical analysis confirms that SMRFL achieves a convergence rate comparable to standard FL without perturbations. SMRFL also excels in non-IID data settings, maintaining high accuracy despite increased data heterogeneity and perturbation effects."
  ],
  "best_summary_idx": 1,
  "summary": "A new robust federated learning method called SMRFL is introduced, which uses sharpness-aware minimization to enhance model robustness against non-malicious perturbations in edge networks. The method converges to flat minima by incorporating SAM, improving resistance to model degradation from both uplink and downlink perturbations. Experiments on real-world datasets show that SMRFL outperforms baselines like FedAvg in test accuracy under various perturbation scenarios, demonstrating its effectiveness in handling non-malicious perturbations. Theoretical analysis confirms that SMRFL achieves a convergence rate comparable to standard FL without perturbations. SMRFL also excels in non-IID data settings, maintaining high accuracy despite increased data heterogeneity and perturbation effects.",
  "evaluation": "Step 1: Check for factual consistency by verifying if all claims in the summary are supported by the source text.\nStep 2: Assess the engagingness by evaluating the summary's ability to capture the essence of the paper and its relevance to a general audience.\nStep 3: Compare the summaries to determine which one is the best based on the evaluation criteria.\n\nFactual Consistency Scores:\nSummary 0: 3\nSummary 1: 3\n\nEngagingness Scores:\nSummary 0: 3\nSummary 1: 3\n\nBest Summary:\n1\nOkay, let's start by evaluating the factual consistency of each summary. \n\nFor Summary 0, it mentions that SMRFL uses sharpness-aware minimization to encourage convergence to flat minima, which is directly supported by the source text. The paper states that SMRFL uses SAM to achieve flat minima, which improves robustness. The experiments on real-world datasets and the comparison with FedAvg are also mentioned, which align with the source text's experimental results. The part about non-IID data is accurate as the paper discusses performance in such settings. There are no major errors here, so it's consistent.\n\nSummary 1 also accurately states that SMRFL uses SAM to converge to flat minima, which is supported. It mentions the convergence rate being comparable to standard FL, which is in the source text. The experiments on real-world datasets and the handling of non-IID data are correctly described.",
  "tweet": "🚀 New method SMRFL boosts model robustness with SAM, outperforming FedAvg in edge networks.\nOkay,",
  "real_tweet": "🚀 New method SMRFL boosts model robustness with SAM, outperforming FedAvg in edge networks.\n Link: https://arxiv.org/abs/2505.24728",
  "model_used": "Qwen/Qwen3-4B",
  "eval_mode": true
}