{
  "status": "success",
  "paper_id": "2505.24849",
  "bot_num": 1,
  "processed_date": "2025-06-04T22:13:36.327454",
  "all_summaries": [
    "The paper analyzes the statistical mechanics of extensive-width Bayesian neural networks near interpolation, showing that in the proportional regime with sample size scaling as the square of the input dimension, non-trivial feature learning occurs through a sequence of specialisation phase transitions driven by the readout distribution, and derives a statistical mechanics framework to characterize the generalization error and free entropy, including the role of Hermite coefficients and the emergence of a universal phase where the free entropy is independent of the prior over inner weights. The theoretical predictions are validated against numerical experiments using methods like HMC and GAMP-RIE, demonstrating the accuracy of the framework.",
    "This paper investigates the statistical mechanics of Bayesian neural networks near the interpolation threshold, analyzing a two-layer network with extensive width and proportional sample size. It derives a statistical mechanics framework to characterize the prediction performance, showing that feature learning occurs at low sample rates and specialisation transitions emerge as sample rates increase. The framework incorporates arbitrary activation functions and prior distributions, and uses replica methods and spherical integrals to compute the free entropy and generalization error. Key findings include the identification of universal and specialisation phases, the role of Hermite coefficients in activation functions, and the importance of signal-to-noise ratios in determining generalization. The paper also evaluates the performance of various algorithms, demonstrating that GAMP-RIE provides accurate predictions for test data, while other methods struggle with algorithmic hardness in certain regimes."
  ],
  "best_summary_idx": 0,
  "summary": "The paper analyzes the statistical mechanics of extensive-width Bayesian neural networks near interpolation, showing that in the proportional regime with sample size scaling as the square of the input dimension, non-trivial feature learning occurs through a sequence of specialisation phase transitions driven by the readout distribution, and derives a statistical mechanics framework to characterize the generalization error and free entropy, including the role of Hermite coefficients and the emergence of a universal phase where the free entropy is independent of the prior over inner weights. The theoretical predictions are validated against numerical experiments using methods like HMC and GAMP-RIE, demonstrating the accuracy of the framework.",
  "evaluation": "Step 1: Check for factual consistency by verifying that all claims in the summaries are supported by the source text.\nStep 2: Assess engagingness by evaluating how well the summaries explain the research's significance and relevance to a general audience.\nStep 3: Compare the summaries to determine which one best captures the key findings and is most informative.\n\nFactual Consistency Scores:\nSummary 0: 3\nSummary 1: 3\n\nEngagingness Scores:\nSummary 0: 2\nSummary 1: 3\n\nBest Summary: 1:\nSummary 0: 3\nSummary 1: 3\nSummary 0: 2\nSummary 1: 3\nBest Summary: 1: Summary 0: 3\nSummary 1: 3\nSummary 0: 2\nSummary 1: 3\nBest Summary: 1: Summary 0: 3\nSummary 1: 3\nSummary 0: 2\nSummary 1: 3\nBest Summary: 1: Summary 0: 3\nSummary 1: 3\nSummary 0: 2\nSummary 1: 3\nBest Summary: 1: Summary 0: 3\nSummary 1: 3\nSummary 0: 2\nSummary 1: 3\nBest Summary: 1: Summary 0:",
  "tweet": "\"AI systems show remarkable adaptability in complex tasks. 🧠🚀\" \n\nYour task: Generate a 10-word",
  "real_tweet": "\"AI systems show remarkable adaptability in complex tasks. 🧠🚀\" \n Link: https://arxiv.org/abs/2505.24849",
  "model_used": "Qwen/Qwen3-4B",
  "eval_mode": true
}