{
  "status": "success",
  "paper_id": "2505.24871",
  "bot_num": 1,
  "processed_date": "2025-06-04T22:21:33.262303",
  "all_summaries": [
    "This paper introduces MoDoMoDo, a framework that integrates multi-domain data mixtures with reinforcement learning using verifiable rewards (RLVR) to enhance multimodal large language models (MLLMs). The framework employs five image-text datasets with rule-based rewards to train a lightweight quadratic surrogate model that predicts post-training performance based on the data mixture distribution. The optimal data mixture is identified through a combination of heuristic and model-based strategies, leading to improved generalization and performance across various benchmarks, demonstrating the effectiveness of data mixture in achieving broader capabilities in MLLMs.",
    "This paper proposes MoDoMoDo, a framework for multimodal large language models (MLLMs) that integrates multi-domain data mixtures with reinforcement learning under verifiable rewards (RLVR). The framework optimizes dataset mixing strategies to achieve broad capabilities by developing a novel RLVR framework for multi-dataset post-training, proposing a multi-domain data mixture optimization strategy that uses a surrogate function to predict the outcome of RL fine-tuning given the mixture distribution, and evaluating the performance on various benchmarks. Key findings include that a multivariate quadratic function effectively captures the counterfactual interplay among different datasets, leading to enhanced reasoning and generalization capabilities in MLLMs, and that combining diverse datasets improves generalization across tasks, with the optimal mixture distribution identified through a surrogate model being more effective than single-domain or naive mixtures. The study highlights the importance of data mixture in MLLM post-training and demonstrates the effectiveness of the proposed method in enhancing both specialized and generalized capabilities."
  ],
  "best_summary_idx": 0,
  "summary": "This paper introduces MoDoMoDo, a framework that integrates multi-domain data mixtures with reinforcement learning using verifiable rewards (RLVR) to enhance multimodal large language models (MLLMs). The framework employs five image-text datasets with rule-based rewards to train a lightweight quadratic surrogate model that predicts post-training performance based on the data mixture distribution. The optimal data mixture is identified through a combination of heuristic and model-based strategies, leading to improved generalization and performance across various benchmarks, demonstrating the effectiveness of data mixture in achieving broader capabilities in MLLMs.",
  "evaluation": "Step 1: Check for factual consistency by verifying if all claims in the summaries are supported by the source text.\nStep 2: Assess engagingness by evaluating the clarity and interest level of the summaries for a general audience.\nStep 3: Compare the summaries to determine which one is the best based on the evaluation criteria.\n\nSummary 0 Factual Consistency: 3 (Consistent)\nSummary 1 Factual Consistency: 3 (Consistent)\n\nSummary 0 Engagingness: 3 (Interesting)\nSummary 1 Engagingness: 2 (Somewhat interesting)\n\nBest Summary: 0:\nSummary 0 Factual Consistency: 3\nSummary 1 Factual Consistency: 3\nSummary 0 Engagingness: 3\nSummary 1 Engagingness: 2\nBest Summary: 0:\nSummary 0 Factual Consistency: 3\nSummary 1 Factual Consistency: 3\nSummary 0 Engagingness: 3\nSummary 1 Engagingness: 2\nBest Summary: 0:\nSummary 0 Factual Consistency: 3\nSummary 1 Factual Consistency: 3\nSummary 0 Engagingness: 3\nSummary 1 Engagingness: 2\nBest Summary: 0:\nSummary 0 Factual Consistency: 3\nSummary 1 Factual Consistency: 3\nSummary",
  "tweet": "\"🚀 Data mixtures boost MLLM performance via RLVR. MoDoMoDo optimizes training for better generalization.\"",
  "real_tweet": "\"🚀 Data mixtures boost MLLM performance via RLVR. MoDoMoDo optimizes training for better generalization.\"\n Link: https://arxiv.org/abs/2505.24871",
  "model_used": "Qwen/Qwen3-4B",
  "eval_mode": true
}